#### ViewPrintingEventArgs Members

---

|  |
| --- |
| ViewPrintingEventArgs Class   Methods   Properties   See Also |

The  ViewPrintingEventArgs  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from  RevitAPIPreEventArgs  .) |
| Public method | Dispose | (Inherited from  RevitAPIEventArgs  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetSettings | Get the print settings of the active printing session. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsCancelled | Indicates whether the event is being cancelled. (Inherited from  RevitAPIEventArgs  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from  RevitAPIEventArgs  .) |
| Public property | Document | The document associated with the event. (Inherited from  RevitAPIPreDocEventArgs  .) |
| Public property | Index | The index of the view being printed out of the set of all views being printed. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RevitAPIEventArgs  .) |
| Public property | TotalViews | The number of all views being printed. |
| Public property | View | The view to be printed. |

# See Also

ViewPrintingEventArgs Class

Autodesk.Revit.DB.Events Namespace